Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterMulti Constructor (Int32)
 Initializes a new instance of the AnalysisDesignParameterMulti class.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDesignParameterMulti(
	int materialType
)
Public Sub New (
	materialType As Integer
)
Parameters
materialType
Type: System.Int32
 The material type of the analysis design parameter.
See Also
Reference
AnalysisDesignParameterMulti Class
AnalysisDesignParameterMulti Overload
Tekla.Structures.Analysis Namespace